{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "functional_1", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 40, 32, 32, 4], "dtype": "float32", "sparse": false, "name": "input_layer_3"}, "registered_name": null, "name": "input_layer_3", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv3D", "config": {"name": "conv3d_18", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 1e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 40, 32, 32, 4]}, "name": "conv3d_18", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 4], "dtype": "float32", "keras_history": ["input_layer_3", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "CT_Module", "config": {"name": "ct__module_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "T": 40, "H": 32, "W": 32, "C": 32, "k1": 4, "k2": 8}, "registered_name": "CT_Module", "build_config": {"input_shape": [null, 40, 32, 32, 32]}, "name": "ct__module_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["conv3d_18", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "CT_Module", "config": {"name": "ct__module_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "T": 40, "H": 32, "W": 32, "C": 32, "k1": 4, "k2": 8}, "registered_name": "CT_Module", "build_config": {"input_shape": [null, 40, 32, 32, 32]}, "name": "ct__module_7", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["ct__module_6", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_42", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 32], [null, 40, 32, 32, 32]]}, "name": "add_42", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["ct__module_7", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["conv3d_18", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 40, 32, 32, 1], "dtype": "float32", "sparse": false, "name": "input_layer_4"}, "registered_name": null, "name": "input_layer_4", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_43", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 32], [null, 40, 32, 32, 32]]}, "name": "add_43", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["add_42", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["conv3d_18", 0, 0]}}]], "kwargs": {}}]}, {"module": null, "class_name": "two_plus_oneDConv", "config": {"name": "two_plus_one_d_conv_6", "filters": 32, "kernel_dims": 3, "H": 32, "W": 32, "C": 1, "T": 40, "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": "two_plus_oneDConv", "build_config": {"input_shape": [null, 40, 32, 32, 1]}, "name": "two_plus_one_d_conv_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 1], "dtype": "float32", "keras_history": ["input_layer_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_44", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 32], [null, 40, 32, 32, 32]]}, "name": "add_44", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["add_43", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["conv3d_18", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 32], [null, 40, 32, 32, 1]]}, "name": "concatenate_16", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["two_plus_one_d_conv_6", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 1], "dtype": "float32", "keras_history": ["input_layer_4", 0, 0]}}]], "kwargs": {}}]}, {"module": null, "class_name": "CT_Module", "config": {"name": "ct__module_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "T": 40, "H": 32, "W": 32, "C": 32, "k1": 4, "k2": 8}, "registered_name": "CT_Module", "build_config": {"input_shape": [null, 40, 32, 32, 32]}, "name": "ct__module_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["add_44", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "two_plus_oneDConv", "config": {"name": "two_plus_one_d_conv_7", "filters": 32, "kernel_dims": 3, "H": 32, "W": 32, "C": 33, "T": 40, "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": "two_plus_oneDConv", "build_config": {"input_shape": [null, 40, 32, 32, 33]}, "name": "two_plus_one_d_conv_7", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 33], "dtype": "float32", "keras_history": ["concatenate_16", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_45", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 32], [null, 40, 32, 32, 32]]}, "name": "add_45", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["ct__module_8", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["ct__module_6", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 32], [null, 40, 32, 32, 33]]}, "name": "concatenate_17", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["two_plus_one_d_conv_7", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 33], "dtype": "float32", "keras_history": ["concatenate_16", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv3D", "config": {"name": "conv3d_25", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 1e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 40, 32, 32, 32]}, "name": "conv3d_25", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["add_45", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "two_plus_oneDConv", "config": {"name": "two_plus_one_d_conv_8", "filters": 32, "kernel_dims": 3, "H": 32, "W": 32, "C": 65, "T": 40, "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": "two_plus_oneDConv", "build_config": {"input_shape": [null, 40, 32, 32, 65]}, "name": "two_plus_one_d_conv_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 65], "dtype": "float32", "keras_history": ["concatenate_17", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "CT_Module", "config": {"name": "ct__module_9", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "T": 40, "H": 32, "W": 32, "C": 64, "k1": 8, "k2": 8}, "registered_name": "CT_Module", "build_config": {"input_shape": [null, 40, 32, 32, 64]}, "name": "ct__module_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["conv3d_25", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "two_plus_oneDConv", "config": {"name": "two_plus_one_d_conv_9", "filters": 64, "kernel_dims": 3, "H": 32, "W": 32, "C": 32, "T": 40, "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": "two_plus_oneDConv", "build_config": {"input_shape": [null, 40, 32, 32, 32]}, "name": "two_plus_one_d_conv_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["two_plus_one_d_conv_8", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "CT_Module", "config": {"name": "ct__module_10", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "T": 40, "H": 32, "W": 32, "C": 64, "k1": 8, "k2": 8}, "registered_name": "CT_Module", "build_config": {"input_shape": [null, 40, 32, 32, 64]}, "name": "ct__module_10", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["ct__module_9", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_18", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 64], [null, 40, 32, 32, 32]]}, "name": "concatenate_18", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["two_plus_one_d_conv_9", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 32], "dtype": "float32", "keras_history": ["two_plus_one_d_conv_8", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_46", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 64], [null, 40, 32, 32, 64]]}, "name": "add_46", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["ct__module_10", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["conv3d_25", 0, 0]}}]], "kwargs": {}}]}, {"module": null, "class_name": "two_plus_oneDConv", "config": {"name": "two_plus_one_d_conv_10", "filters": 64, "kernel_dims": 3, "H": 32, "W": 32, "C": 96, "T": 40, "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": "two_plus_oneDConv", "build_config": {"input_shape": [null, 40, 32, 32, 96]}, "name": "two_plus_one_d_conv_10", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 96], "dtype": "float32", "keras_history": ["concatenate_18", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "CT_Module", "config": {"name": "ct__module_11", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "T": 40, "H": 32, "W": 32, "C": 64, "k1": 8, "k2": 8}, "registered_name": "CT_Module", "build_config": {"input_shape": [null, 40, 32, 32, 64]}, "name": "ct__module_11", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["add_46", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_19", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 64], [null, 40, 32, 32, 96]]}, "name": "concatenate_19", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["two_plus_one_d_conv_10", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 96], "dtype": "float32", "keras_history": ["concatenate_18", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_47", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 40, 32, 32, 64], [null, 40, 32, 32, 64]]}, "name": "add_47", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["ct__module_11", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["ct__module_9", 0, 0]}}]], "kwargs": {}}]}, {"module": null, "class_name": "two_plus_oneDConv", "config": {"name": "two_plus_one_d_conv_11", "filters": 64, "kernel_dims": 3, "H": 32, "W": 32, "C": 160, "T": 40, "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": "two_plus_oneDConv", "build_config": {"input_shape": [null, 40, 32, 32, 160]}, "name": "two_plus_one_d_conv_11", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 160], "dtype": "float32", "keras_history": ["concatenate_19", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "iAFF_3D", "config": {"channels": 64, "reduction": 16, "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}}, "registered_name": "iAFF_3D", "build_config": {"input_shape": [null, 40, 32, 32, 64]}, "name": "i_aff_3d_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["add_47", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["two_plus_one_d_conv_11", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "function": {"class_name": "__lambda__", "config": {"code": "4wEAAAAAAAAAAAAAAAgAAAADAAAA84IAAACXAHQAAAAAAAAAAAAAAKABAAAAAAAAAAAAAAAAAAAA\nAAAAAAB8AGQBfABqAgAAAAAAAAAAZAIZAAAAAAAAAAAAfABqAgAAAAAAAAAAZAMZAAAAAAAAAAAA\nfABqAgAAAAAAAAAAZAQZAAAAAAAAAAAAZgSmAgAAqwIAAAAAAAAAAFMAKQVO6f/////pAgAAAOkD\nAAAA6QQAAAApA9oCdGbaB3Jlc2hhcGXaBXNoYXBlKQHaAXhzAQAAACD6Hy90bXAvaXB5a2VybmVs\nXzM2LzIyMzQzNjI2NjEucHn6CDxsYW1iZGE+cgsAAADRAgAAczcAAACAALVCt0qySrhxwDLAccR3\nyHHEetBTVNRTWtBbXNRTXdBfYNRfZtBnaNRfadBCatE0a9Q0a4AA8wAAAAA=\n", "defaults": null, "closure": null}}, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 40, 32, 32, 64]}, "name": "lambda_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 64], "dtype": "float32", "keras_history": ["i_aff_3d_1", 0, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 128], "dtype": "float32", "keras_history": ["tea_mta_3", 0, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_3", 1, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 128], "dtype": "float32", "keras_history": ["tea_mta_4", 0, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_3", 3, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 128], "dtype": "float32", "keras_history": ["tea_mta_5", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_39", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 1e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32, 32, 64]}, "name": "conv2d_39", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 64], "dtype": "float32", "keras_history": ["lambda_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "function": {"class_name": "__lambda__", "config": {"code": "4wEAAAAAAAAAAAAAAAkAAAADAAAA84QAAACXAHQAAAAAAAAAAAAAAKABAAAAAAAAAAAAAAAAAAAA\nAAAAAAB8AGQBZAJ8AGoCAAAAAAAAAABkAxkAAAAAAAAAAAB8AGoCAAAAAAAAAABkBBkAAAAAAAAA\nAAB8AGoCAAAAAAAAAABkBRkAAAAAAAAAAABmBaYCAACrAgAAAAAAAAAAUwApBk7p/////+koAAAA\n6QEAAADpAgAAAOkDAAAAKQPaAnRm2gdyZXNoYXBl2gVzaGFwZSkB2gF4cwEAAAAg+h8vdG1wL2lw\neWtlcm5lbF8zNi8yMjM0MzYyNjYxLnB5+gg8bGFtYmRhPnIMAAAA0gIAAHM6AAAAgAC1Ercashq4\nQcACwELIAcwH0FBRzArQVFXUVFvQXF3UVF7QYGHUYGfQaGnUYGrQP2vRMWzUMWyAAPMAAAAA\n", "defaults": null, "closure": null}}, "arguments": {}}, "registered_name": null, "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "lambda_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["conv2d_39", 0, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["conv2d_43", 0, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["conv2d_44", 0, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["conv2d_48", 0, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["conv2d_49", 0, 0]}}], "kwargs": {"mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["conv2d_53", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": null, "class_name": "TEA_MTA", "config": {"name": "tea_mta_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "num_channels": 128, "N": 2, "T": 40, "H": 32, "W": 32}, "registered_name": "TEA_MTA", "build_config": {"input_shape": [null, 40, 32, 32, 128]}, "name": "tea_mta_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_3", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_43", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 1e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "conv2d_43", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_2", 1, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_44", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 1e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "conv2d_44", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_2", 2, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "TEA_MTA", "config": {"name": "tea_mta_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "num_channels": 128, "N": 2, "T": 40, "H": 32, "W": 32}, "registered_name": "TEA_MTA", "build_config": {"input_shape": [null, 40, 32, 32, 128]}, "name": "tea_mta_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_3", 2, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 1e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "conv2d_48", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_2", 3, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_49", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 1e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "conv2d_49", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_2", 4, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "TEA_MTA", "config": {"name": "tea_mta_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "num_channels": 128, "N": 2, "T": 40, "H": 32, "W": 32}, "registered_name": "TEA_MTA", "build_config": {"input_shape": [null, 40, 32, 32, 128]}, "name": "tea_mta_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_3", 4, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d_53", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 1e-05}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32, 32, 128]}, "name": "conv2d_53", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_2", 5, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling3D", "config": {"name": "global_average_pooling3d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last", "keepdims": false}, "registered_name": null, "name": "global_average_pooling3d_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 32, 32, 128], "dtype": "float32", "keras_history": ["lambda_3", 5, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_10", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["global_average_pooling3d_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.2, "seed": null, "noise_shape": null}, "registered_name": null, "name": "dropout_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["dense_10", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0001}, "registered_name": null}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "dense_11", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["dropout_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "input_layer_5"}, "registered_name": null, "name": "input_layer_5", "inbound_nodes": []}, {"module": null, "class_name": "ArcFace", "config": {"name": "arc_face_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "n_classes": 11, "s": 30.0, "m": 0.2, "regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0001}, "registered_name": null}}, "registered_name": "ArcFace", "build_config": {"input_shape": [[null, 256], [null, 11]]}, "name": "arc_face_1", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["dense_11", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 11], "dtype": "float32", "keras_history": ["input_layer_5", 0, 0]}}]], "kwargs": {}}]}], "input_layers": [["input_layer_3", 0, 0], ["input_layer_4", 0, 0], ["input_layer_5", 0, 0]], "output_layers": [["arc_face_1", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 9.999999747378752e-05, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}