{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 40, 32, 32, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 40, 32, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "CT_Module", "config": {"name": "ct__module", "trainable": true, "dtype": "float32", "T": 40, "H": 32, "W": 32, "C": 32, "k1": 4, "k2": 8}, "name": "ct__module", "inbound_nodes": [[["conv3d", 0, 0, {}]]]}, {"class_name": "CT_Module", "config": {"name": "ct__module_1", "trainable": true, "dtype": "float32", "T": 40, "H": 32, "W": 32, "C": 32, "k1": 4, "k2": 8}, "name": "ct__module_1", "inbound_nodes": [[["ct__module", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["ct__module_1", 0, 0, {}], ["conv3d", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["add", 0, 0, {}], ["conv3d", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["add_1", 0, 0, {}], ["conv3d", 0, 0, {}]]]}, {"class_name": "CT_Module", "config": {"name": "ct__module_2", "trainable": true, "dtype": "float32", "T": 40, "H": 32, "W": 32, "C": 32, "k1": 4, "k2": 8}, "name": "ct__module_2", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["ct__module_2", 0, 0, {}], ["ct__module", 0, 0, {}]]]}, {"class_name": "Cross_MSECA_Module", "config": {"name": "cross_mseca__module", "trainable": true, "dtype": "float32", "T": 40, "H": 32, "W": 32, "C": 32, "k": 3}, "name": "cross_mseca__module", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["cross_mseca__module", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAIAAAAQwAAAHMmAAAAdACgAXwAZAF8AGoCZAIZAHwAagJkAxkAfABq\nAmQEGQBmBKECUwApBU7p/////+kCAAAA6QMAAADpBAAAAKkD2gJ0ZtoHcmVzaGFwZdoFc2hhcGWp\nAdoBeKkAcgsAAAD6Ii4vZXhwXzNfKHJkaStyYWkpX3JkaV9tZXNjYV9nbW4ucHnaCDxsYW1iZGE+\nlQIAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["add_4", 0, 0, {}]], [["tea_mta", 0, 0, {}]], [["lambda_1", 1, 0, {}]], [["tea_mta_1", 0, 0, {}]], [["lambda_1", 3, 0, {}]], [["tea_mta_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_12", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAJAAAAQwAAAHMoAAAAdACgAXwAZAFkAnwAagJkAxkAfABqAmQEGQB8\nAGoCZAUZAGYFoQJTACkGTun/////6SgAAADpAQAAAOkCAAAA6QMAAACpA9oCdGbaB3Jlc2hhcGXa\nBXNoYXBlqQHaAXipAHIMAAAA+iIuL2V4cF8zXyhyZGkrcmFpKV9yZGlfbWVzY2FfZ21uLnB52gg8\nbGFtYmRhPpYCAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["conv2d_12", 0, 0, {}]], [["conv2d_16", 0, 0, {}]], [["conv2d_17", 0, 0, {}]], [["conv2d_21", 0, 0, {}]], [["conv2d_22", 0, 0, {}]], [["conv2d_26", 0, 0, {}]]]}, {"class_name": "TEA_MTA", "config": {"name": "tea_mta", "trainable": true, "dtype": "float32", "num_channels": 128, "N": 2, "T": 40, "H": 32, "W": 32}, "name": "tea_mta", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_16", "inbound_nodes": [[["lambda", 1, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_17", "inbound_nodes": [[["lambda", 2, 0, {}]]]}, {"class_name": "TEA_MTA", "config": {"name": "tea_mta_1", "trainable": true, "dtype": "float32", "num_channels": 128, "N": 2, "T": 40, "H": 32, "W": 32}, "name": "tea_mta_1", "inbound_nodes": [[["lambda_1", 2, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_21", "inbound_nodes": [[["lambda", 3, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_22", "inbound_nodes": [[["lambda", 4, 0, {}]]]}, {"class_name": "TEA_MTA", "config": {"name": "tea_mta_2", "trainable": true, "dtype": "float32", "num_channels": 128, "N": 2, "T": 40, "H": 32, "W": 32}, "name": "tea_mta_2", "inbound_nodes": [[["lambda_1", 4, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_26", "inbound_nodes": [[["lambda", 5, 0, {}]]]}, {"class_name": "GlobalAveragePooling3D", "config": {"name": "global_average_pooling3d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling3d", "inbound_nodes": [[["lambda_1", 5, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["global_average_pooling3d", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "ArcFace", "config": {"name": "arc_face", "trainable": true, "dtype": "float32", "n_classes": 11, "s": 30.0, "m": 0.2, "regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}, "__passive_serialization__": true}}, "name": "arc_face", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["arc_face", 0, 0]]}, "keras_version": "2.5.0", "backend": "tensorflow"}